uhnp/src/InformationRegisters/ВерсииИзмененийУправлениеПерсоналом/ВерсииИзмененийУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииИзмененийУправлениеПерсоналом</name>
  <resources>
    <name>ВерсияИзменений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Приложение</name>
    <type>
      <types>EnumRef.ПриложенияДляИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ВерсииИзмененийУправлениеПерсоналом/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВерсияИзменений(Приложение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ВерсииИзмененийУправлениеПерсоналом.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Приложение = Приложение;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.ВерсияИзменений;

КонецФункции

Функция ЗаписатьВерсиюИзменений(Приложение, ВерсияИзменений) Экспорт

	МенеджерЗаписи = РегистрыСведений.ВерсииИзмененийУправлениеПерсоналом.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Приложение = Приложение;
	МенеджерЗаписи.ВерсияИзменений = ВерсияИзменений;
	МенеджерЗаписи.Записать();

КонецФункции

#КонецОбласти

#КонецЕсли
